In [3]:
import pandas as pd,os

In [101]:
os.chdir('C:/Users/Manjunath/Desktop/Raw_Data')

In [102]:
week1=pd.read_csv("Restaurant - Week 1 Sales.csv")
week2=pd.read_csv("Restaurant - Week 2 Sales.csv")
food=pd.read_csv("Restaurant - Foods.csv")
customer=pd.read_csv("Restaurant - Customers.csv")

In [6]:
week1.head()

   Customer ID  Food ID
0          537        9
1           97        4
2          658        1
3          202        2
4          155        9

In [7]:
week2.head()

   Customer ID  Food ID
0          688       10
1          813        7
2          495       10
3          189        5
4          267        3

In [8]:
food.head()

   Food ID   Food Item  Price
0        1       Sushi   3.99
1        2     Burrito   9.99
2        3        Taco   2.99
3        4  Quesadilla   4.25
4        5       Pizza   2.49

In [9]:
customer.head()

   ID First Name Last Name  Gender  Company                     Occupation
0   1     Joseph   Perkins    Male  Dynazzy  Community Outreach Specialist
1   2   Jennifer   Alvarez  Female     DabZ        Senior Quality Engineer
2   3      Roger     Black    Male  Tagfeed              Account Executive
3   4     Steven     Evans    Male     Fatz               Registered Nurse
4   5       Judy  Morrison  Female  Demivee                Legal Assistant

## pd.concat Method, Part 1

In [176]:
pd.concat(objs=[week1,week2])

     Customer ID  Food ID
0            537        9
1             97        4
2            658        1
3            202        2
4            155        9
..           ...      ...
245          783       10
246          556       10
247          547        9
248          252        9
249          249        6

[500 rows x 2 columns]

500 rows , but the index positions are didnt change as like orginal in the DataFrame

In [11]:
pd.concat(objs=[week1,week2],ignore_index=True)

     Customer ID  Food ID
0            537        9
1             97        4
2            658        1
3            202        2
4            155        9
..           ...      ...
495          783       10
496          556       10
497          547        9
498          252        9
499          249        6

[500 rows x 2 columns]

In [179]:
week2

     Customer ID  Food ID
0            688       10
1            813        7
2            495       10
3            189        5
4            267        3
..           ...      ...
245          783       10
246          556       10
247          547        9
248          252        9
249          249        6

[250 rows x 2 columns]

## pd.concat Method, Part 2 (Multi indexing)

In [178]:
pd.concat(objs=[week1,week2],axis=1)

     Customer ID  Food ID  Customer ID  Food ID
0            537        9          688       10
1             97        4          813        7
2            658        1          495       10
3            202        2          189        5
4            155        9          267        3
..           ...      ...          ...      ...
245          413        9          783       10
246          926        6          556       10
247          134        3          547        9
248          396        6          252        9
249          535       10          249        6

[250 rows x 4 columns]

Mutliti indix usefull when the two tables having same  data at same index number.

In [182]:
sales=pd.concat(objs=[week1,week2],keys=['week3','week2'])
sales

# here the keys and objs should have same lenght(number of rows should be same)
# the default is outter join

           Customer ID  Food ID
week3 0            537        9
      1             97        4
      2            658        1
      3            202        2
      4            155        9
...                ...      ...
week2 245          783       10
      246          556       10
      247          547        9
      248          252        9
      249          249        6

[500 rows x 2 columns]

In [187]:
sales=pd.concat(objs=[week1,week2],keys = ["Week1", "Week2"])
sales

           Customer ID  Food ID
Week1 0            537        9
      1             97        4
      2            658        1
      3            202        2
      4            155        9
...                ...      ...
Week2 245          783       10
      246          556       10
      247          547        9
      248          252        9
      249          249        6

[500 rows x 2 columns]

In [29]:
sales.columns

Index(['Customer ID', 'Food ID'], dtype='object')

In [37]:
sales.loc["week1"]
#sales.loc["week1",3,"Customer ID"] # it will give the error bcz it have to many indexes so----

sales.loc[("week1",3),"Customer ID"]

202

In [39]:
sales.loc[("week1",3),["Customer ID","Food ID"]] # multi indexed paseed in tupule, and columns are passed in the list

Customer ID    202
Food ID          2
Name: (week1, 3), dtype: int64

## Inner Join part

In [42]:
week1.head(2)

   Customer ID  Food ID
0          537        9
1           97        4

In [41]:
week2.head(2)

   Customer ID  Food ID
0          688       10
1          813        7

In [45]:
week1.merge(week2,how="inner",on="Customer ID").head()

how : {'left', 'right', 'outer', 'inner', 'cross'}, default 'inner'
    Type of merge to be performed.

    * left: use only keys from left frame, similar to a SQL left outer join;
          preserve key order.
    * right: use only keys from right frame, similar to a SQL right outer join;
          preserve key order.
    * outer: use union of keys from both frames, similar to a SQL full outer
          join; sort keys lexicographically.
    * inner: use intersection of keys from both frames, similar to a SQL inner
          join; preserve the order of the left keys.
    * cross: creates the cartesian product from both frames, preserves the order
          of the left keys.
            

on : label or list
    Column or index level names to join on. These must be found in both
    DataFrames. If `on` is None and not merging on indexes then this defaults
    to the intersection of the columns in both DataFrames.

suffixes : list-like, default is ("_x", "_y")
    A length-2 sequence where each element is optionally a string
    indicating the suffix to add to overlapping column names in
    `left` and `right` respectively. Pass a value of `None` instead
    of a string to indicate that the column name from `left` or
    `right` should be left as-is, with no suffix. At least one of the
    values must not be None
    
suffixes : list-like, default is ("_x", "_y")

   Customer ID  Food ID_x  Food ID_y
0          537          9          5
1          155          9          3
2          155          1          3
3          503          5          8
4          503          5          9

In [189]:
df=week1.merge(week2,how="inner",on="Customer ID",suffixes=["-week1","-week2"])
df

    Customer ID  Food ID-week1  Food ID-week2
0           537              9              5
1           155              9              3
2           155              1              3
3           503              5              8
4           503              5              9
..          ...            ...            ...
57          945              5              4
58          343              3              5
59          343              3              2
60          343              3              7
61          621              9              6

[62 rows x 3 columns]

In [52]:
df[df["Customer ID"]==155]

   Customer ID  Food ID-week1  Food ID-week2
1          155              9              3
2          155              1              3

In [191]:
week1.merge(week2,how="inner",on=["Customer ID","Food ID"])

   Customer ID  Food ID
0          304        3
1          540        3
2          937       10
3          233        3
4           21        4
5           21        4
6          922        1
7          578        5
8          578        5

## Outer Join

In [59]:
week1.head(3)

   Customer ID  Food ID
0          537        9
1           97        4
2          658        1

In [60]:
week2.head(3)

   Customer ID  Food ID
0          688       10
1          813        7
2          495       10

In [75]:
merged=week1.merge(week2,how='outer',on="Customer ID",suffixes=["-week1","-week2"],indicator=True)
merged

     Customer ID  Food ID-week1  Food ID-week2      _merge
0            537            9.0            5.0        both
1             97            4.0            NaN   left_only
2            658            1.0            NaN   left_only
3            202            2.0            NaN   left_only
4            155            9.0            3.0        both
..           ...            ...            ...         ...
449          855            NaN            4.0  right_only
450          559            NaN           10.0  right_only
451          276            NaN            4.0  right_only
452          556            NaN           10.0  right_only
453          252            NaN            9.0  right_only

[454 rows x 4 columns]

In [77]:
merged["_merge"].value_counts()

right_only    197
left_only     195
both           62
Name: _merge, dtype: int64

In [88]:
merged[merged["_merge"]=="both"]

# both data have the same value

     Customer ID  Food ID-week1  Food ID-week2 _merge
0            537            9.0            5.0   both
4            155            9.0            3.0   both
5            155            1.0            3.0   both
8            503            5.0            8.0   both
9            503            5.0            9.0   both
..           ...            ...            ...    ...
246          945            5.0            4.0   both
247          343            3.0            5.0   both
248          343            3.0            2.0   both
249          343            3.0            7.0   both
251          621            9.0            6.0   both

[62 rows x 4 columns]

In [89]:
mergeed_left_and_right=merged[merged["_merge"].isin(["left_only","Right_only"])]
mergeed_left_and_right

# it conatin only both left and right data point(exclding the common data points among the two DataFrame)

     Customer ID  Food ID-week1  Food ID-week2     _merge
1             97            4.0            NaN  left_only
2            658            1.0            NaN  left_only
3            202            2.0            NaN  left_only
6            213            8.0            NaN  left_only
7            600            1.0            NaN  left_only
..           ...            ...            ...        ...
252          413            9.0            NaN  left_only
253          926            6.0            NaN  left_only
254          134            3.0            NaN  left_only
255          396            6.0            NaN  left_only
256          535           10.0            NaN  left_only

[195 rows x 4 columns]

## Left Join

In [90]:
week1.head()

   Customer ID  Food ID
0          537        9
1           97        4
2          658        1
3          202        2
4          155        9

In [91]:
food.head()

   Food ID   Food Item  Price
0        1       Sushi   3.99
1        2     Burrito   9.99
2        3        Taco   2.99
3        4  Quesadilla   4.25
4        5       Pizza   2.49

left joins is like vlookup in excel

In [104]:
week1=week1.merge(food,how="left",sort=True).head()

In [105]:
week1

   Customer ID  Food ID Food Item  Price
0          658        1     Sushi   3.99
1          600        1     Sushi   3.99
2          155        1     Sushi   3.99
3          341        1     Sushi   3.99
4           20        1     Sushi   3.99

## The left_on and right_on Parameters

Different column names are specified for merges in Pandas using the “left_on” and “right_on” parameters, instead of using only the “on” parameter. 

Merging dataframes with different names for the joining variable is achieved using the left_on and right_on arguments to the pandas merge function.

Here the Customer ID and the ID columns are example

In [110]:
week2.head(3)

   Customer ID  Food ID
0          688       10
1          813        7
2          495       10

In [111]:
customer.head(3)

   ID First Name Last Name  Gender  Company                     Occupation
0   1     Joseph   Perkins    Male  Dynazzy  Community Outreach Specialist
1   2   Jennifer   Alvarez  Female     DabZ        Senior Quality Engineer
2   3      Roger     Black    Male  Tagfeed              Account Executive

In [117]:
 week2.merge(customer,how='inner',left_on="Customer ID",right_on="ID")

,Customer ID,Food ID,ID,First Name,Last Name,Gender,Company,Occupation
0,688,10,688,Carl,Williamson,Male,Thoughtmix,Graphic Designer
1,813,7,813,Johnny,Walker,Male,Kayveo,Developer II
2,495,10,495,Deborah,Little,Female,Babbleblab,VP Accounting
3,495,6,495,Deborah,Little,Female,Babbleblab,VP Accounting
4,495,2,495,Deborah,Little,Female,Babbleblab,VP Accounting
...,...,...,...,...,...,...,...,...
245,945,4,945,Anne,Reed,Female,Twitterworks,Director of Sales
246,783,10,783,Phyllis,Meyer,Female,Voolia,Information Systems Manager
247,556,10,556,Samuel,Bailey,Male,Oyoloo,Nurse
248,252,9,252,Douglas,Powell,Male,Jetwire,Geologist IV
249,249,6,249,Anthony,Carpenter,Male,Shuffletag,Health Coach I

In [119]:
week2.merge(customer,how='inner',left_on="Customer ID",right_on="ID",sort=True).drop('ID',axis="columns")

,Customer ID,Food ID,First Name,Last Name,Gender,Company,Occupation
0,8,6,Frances,Adams,Female,Dabshots,Developer III
1,13,2,Ruth,Alvarez,Female,Twitterlist,Mechanical Systems Engineer
2,21,4,Albert,Burns,Male,Rhynoodle,Junior Executive
3,24,8,Donna,Thomas,Female,Jaxbean,Chief Design Engineer
4,27,4,Jessica,Bennett,Female,Twitternation,Account Executive
...,...,...,...,...,...,...,...
245,968,4,Teresa,Reynolds,Female,Flashdog,Budget/Accounting Analyst IV
246,969,3,Marie,Ortiz,Female,Meejo,Research Associate
247,977,7,Cynthia,Dixon,Female,Skalith,Automation Specialist II
248,994,2,Clarence,Morgan,Male,Edgewire,Geologist II
249,996,10,Debra,Garcia,Female,Dazzlesphere,Structural Engineer

## The left_index and right_index Parameters

In [125]:
week1=pd.read_csv("Restaurant - Week 1 Sales.csv")
week2=pd.read_csv("Restaurant - Week 2 Sales.csv")
food=pd.read_csv("Restaurant - Foods.csv",index_col="Food ID")
customer=pd.read_csv("Restaurant - Customers.csv",index_col="ID")

In [130]:
week1.head(3)

   Customer ID  Food ID
0          537        9
1           97        4
2          658        1

In [129]:
customer.head(3)

   First Name Last Name  Gender  Company                     Occupation
ID
1      Joseph   Perkins    Male  Dynazzy  Community Outreach Specialist
2    Jennifer   Alvarez  Female     DabZ        Senior Quality Engineer
3       Roger     Black    Male  Tagfeed              Account Executive

In [134]:
week1.merge(customer,how="left",left_on="Customer ID",right_index=ID)

# here no need to menstion the name of the index name

NameError: name 'ID' is not defined

In [138]:
sales=week1.merge(customer,how="left",left_on="Customer ID",right_index=True).head()
sales

,Customer ID,Food ID,First Name,Last Name,Gender,Company,Occupation
0,537,9,Cheryl,Carroll,Female,Zoombeat,Registered Nurse
1,97,4,Amanda,Watkins,Female,Ozu,Account Coordinator
2,658,1,Patrick,Webb,Male,Browsebug,Community Outreach Specialist
3,202,2,Louis,Campbell,Male,Rhynoodle,Account Representative III
4,155,9,Carolyn,Diaz,Female,Gigazoom,Database Administrator III

In [140]:
food.head(3)

        Food Item  Price
Food ID
1           Sushi   3.99
2         Burrito   9.99
3            Taco   2.99

In [145]:
sales=sales.merge(food,how="left",left_on="Customer ID",right_index=True)
sales.head()

,Customer ID,Food ID,First Name,Last Name,Gender,Company,Occupation,Food Item,Price
0,537,9,Cheryl,Carroll,Female,Zoombeat,Registered Nurse,NaN,NaN
1,97,4,Amanda,Watkins,Female,Ozu,Account Coordinator,NaN,NaN
2,658,1,Patrick,Webb,Male,Browsebug,Community Outreach Specialist,NaN,NaN
3,202,2,Louis,Campbell,Male,Rhynoodle,Account Representative III,NaN,NaN
4,155,9,Carolyn,Diaz,Female,Gigazoom,Database Administrator III,NaN,NaN

In [147]:
week1.head(3)

   Customer ID  Food ID
0          537        9
1           97        4
2          658        1

In [149]:
week2.head(3)

   Customer ID  Food ID
0          688       10
1          813        7
2          495       10

In [150]:
week1.head(3)

   Customer ID  Food ID
0          537        9
1           97        4
2          658        1

In [152]:
week1.merge(week2,how='left',left_index=True,right_index=True,suffixes=["-Week1","-week2"])

     Customer ID-Week1  Food ID-Week1  Customer ID-week2  Food ID-week2
0                  537              9                688             10
1                   97              4                813              7
2                  658              1                495             10
3                  202              2                189              5
4                  155              9                267              3
..                 ...            ...                ...            ...
245                413              9                783             10
246                926              6                556             10
247                134              3                547              9
248                396              6                252              9
249                535             10                249              6

[250 rows x 4 columns]

## The .join( ) Method

In [156]:
week1=pd.read_csv("Restaurant - Week 1 Sales.csv")
week2=pd.read_csv("Restaurant - Week 2 Sales.csv")
Satisfaction=pd.read_csv("Restaurant - Week 1 Satisfaction.csv").head()
Satisfaction

   Satisfaction Rating
0                    2
1                    7
2                    3
3                    7
4                   10

In [158]:
week1.head(3)

   Customer ID  Food ID
0          537        9
1           97        4
2          658        1

In [161]:
week1.merge(Satisfaction,how='left',left_index=True,right_index=True).head()

   Customer ID  Food ID  Satisfaction Rating
0          537        9                  2.0
1           97        4                  7.0
2          658        1                  3.0
3          202        2                  7.0
4          155        9                 10.0

if we are joining based on the index, if the two tales having same index number .join( ) is easy to use

In [193]:
week1.join(Satisfaction).head()

   Customer ID  Food ID  Satisfaction Rating
0          537        9                  2.0
1           97        4                  7.0
2          658        1                  3.0
3          202        2                  7.0
4          155        9                 10.0

above two tables are same

## The pd.merge( ) Method

In [165]:
week1=pd.read_csv("Restaurant - Week 1 Sales.csv")
week2=pd.read_csv("Restaurant - Week 2 Sales.csv")
Satisfaction=pd.read_csv("Restaurant - Week 1 Satisfaction.csv").head()

In [169]:
week1.head(3)

   Customer ID  Food ID
0          537        9
1           97        4
2          658        1

In [170]:
customer.head(3)

   First Name Last Name  Gender  Company                     Occupation
ID
1      Joseph   Perkins    Male  Dynazzy  Community Outreach Specialist
2    Jennifer   Alvarez  Female     DabZ        Senior Quality Engineer
3       Roger     Black    Male  Tagfeed              Account Executive

In [172]:
pd.merge(week1,customer,how="left",left_on="Customer ID",right_index=True).head()

,Customer ID,Food ID,First Name,Last Name,Gender,Company,Occupation
0,537,9,Cheryl,Carroll,Female,Zoombeat,Registered Nurse
1,97,4,Amanda,Watkins,Female,Ozu,Account Coordinator
2,658,1,Patrick,Webb,Male,Browsebug,Community Outreach Specialist
3,202,2,Louis,Campbell,Male,Rhynoodle,Account Representative III
4,155,9,Carolyn,Diaz,Female,Gigazoom,Database Administrator III

In [206]:
a=0

In [207]:
type(a)

int

In [208]:
pd.Series(a)

0    0
dtype: int64

In [209]:
dis={"A":20,"B":30,"C":40}

In [212]:
pd.DataFrame(dis,index=[0])

    A   B   C
0  20  30  40

In [214]:
s=pd.Series(dis)
s

A    20
B    30
C    40
dtype: int64

In [215]:
df=pd.DataFrame(s)

    0
A  20
B  30
C  40

In [216]:
type(dis)

dict

In [220]:
a="Good Match  "

In [228]:
a.strip().endswith("h")

True

In [236]:
df.shape

(62, 3)

In [238]:
list1=["A","b",'c','d']

In [239]:
list1.append("g")

In [240]:
list1

['A', 'b', 'c', 'd', 'g']

In [243]:
list1.append(["o","y"])

In [244]:
list1

['A', 'b', 'c', 'd', 'g', ['o', 'y']]

In [246]:
list1[-1]

['o', 'y']

In [250]:
list1.append('x')

In [251]:
list1

['A', 'b', 'c', 'd', 'g', ['o', 'y'], ('x', 'z'), 'x']

In [253]:
list1.remove()

TypeError: list.remove() takes exactly one argument (0 given)

In [256]:
list1.pop()

['o', 'y']

In [257]:
list1

['A', 'b', 'c', 'd', 'g']

In [262]:
del list1[3]

In [263]:
list1

['b', 'c', 'd']

In [264]:
50/2

25.0

In [265]:
50//2

25

In [266]:
15//4

3

In [267]:
16//4

4

In [269]:
120//3

40

In [271]:
17//4

4

In [272]:
15%4

3

In [273]:
15%7

1

In [277]:
s=pd.Series(list1)

In [279]:
s.size

3

In [281]:
len(s)

3

In [284]:
s.values

array(['b', 'c', 'd'], dtype=object)

In [285]:
df

    Customer ID  Food ID-week1  Food ID-week2
0           537              9              5
1           155              9              3
2           155              1              3
3           503              5              8
4           503              5              9
..          ...            ...            ...
57          945              5              4
58          343              3              5
59          343              3              2
60          343              3              7
61          621              9              6

[62 rows x 3 columns]

In [286]:
df.columns

Index(['Customer ID', 'Food ID-week1', 'Food ID-week2'], dtype='object')

In [287]:
df.size

186

In [288]:
len(df)

62